app/controllers/settings_controller.rb

  def show
    response_object = ApplicationController.initialize_response_object
    customer = Customer.find_by_id(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "55"]]