app/controllers/user_controller.rb

INSERT INTO "users" ("contact_info", "created_at", "customer_id", "device_carrier", "device_id", "device_locale", "device_os", "device_type", "sdk_version", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    response_object = ApplicationController.initialize_response_object
    user = User.create_user_record(params)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
UPDATE "users" SET "device_id" = '12345632', "updated_at" = '2013-11-19 05:42:26.689150' WHERE "users"."id" = 2
---
  def update
    response_object = ApplicationController.initialize_response_object
    user = User.find_by_id(params[:id])
    if user
      update_user = User.update_user_record(user,params)